ebs-universe/ebs-sandbox-stm32h7rsxx/resources/h7s3l8_nucleo_mx.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_2
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_4
ADC1.Channel-2\#ChannelRegularConversion=ADC_CHANNEL_5
ADC1.Channel-3\#ChannelRegularConversion=ADC_CHANNEL_6
ADC1.Channel-4\#ChannelRegularConversion=ADC_CHANNEL_8
ADC1.Channel-5\#ChannelRegularConversion=ADC_CHANNEL_10
ADC1.Channel-6\#ChannelRegularConversion=ADC_CHANNEL_12
ADC1.Channel-7\#ChannelRegularConversion=ADC_CHANNEL_13
ADC1.Channel-8\#ChannelRegularConversion=ADC_CHANNEL_15
ADC1.Channel-9\#ChannelRegularConversion=ADC_CHANNEL_TEMPSENSOR
ADC1.ClockPrescaler=ADC_CLOCK_ASYNC_DIV8
ADC1.ExternalTrigConv=ADC_EXTERNALTRIG_T15_TRGO
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,OffsetSign-0\#ChannelRegularConversion,NbrOfConversionFlag,master,ClockPrescaler,ExternalTrigConv,Rank-1\#ChannelRegularConversion,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,OffsetNumber-1\#ChannelRegularConversion,OffsetSign-1\#ChannelRegularConversion,Rank-2\#ChannelRegularConversion,Channel-2\#ChannelRegularConversion,SamplingTime-2\#ChannelRegularConversion,OffsetNumber-2\#ChannelRegularConversion,OffsetSign-2\#ChannelRegularConversion,Rank-3\#ChannelRegularConversion,Channel-3\#ChannelRegularConversion,SamplingTime-3\#ChannelRegularConversion,OffsetNumber-3\#ChannelRegularConversion,OffsetSign-3\#ChannelRegularConversion,Rank-4\#ChannelRegularConversion,Channel-4\#ChannelRegularConversion,SamplingTime-4\#ChannelRegularConversion,OffsetNumber-4\#ChannelRegularConversion,OffsetSign-4\#ChannelRegularConversion,Rank-5\#ChannelRegularConversion,Channel-5\#ChannelRegularConversion,SamplingTime-5\#ChannelRegularConversion,OffsetNumber-5\#ChannelRegularConversion,OffsetSign-5\#ChannelRegularConversion,Rank-6\#ChannelRegularConversion,Channel-6\#ChannelRegularConversion,SamplingTime-6\#ChannelRegularConversion,OffsetNumber-6\#ChannelRegularConversion,OffsetSign-6\#ChannelRegularConversion,Rank-7\#ChannelRegularConversion,Channel-7\#ChannelRegularConversion,SamplingTime-7\#ChannelRegularConversion,OffsetNumber-7\#ChannelRegularConversion,OffsetSign-7\#ChannelRegularConversion,Rank-8\#ChannelRegularConversion,Channel-8\#ChannelRegularConversion,SamplingTime-8\#ChannelRegularConversion,OffsetNumber-8\#ChannelRegularConversion,OffsetSign-8\#ChannelRegularConversion,Rank-9\#ChannelRegularConversion,Channel-9\#ChannelRegularConversion,SamplingTime-9\#ChannelRegularConversion,OffsetNumber-9\#ChannelRegularConversion,OffsetSign-9\#ChannelRegularConversion,NbrOfConversion
ADC1.NbrOfConversion=10
ADC1.NbrOfConversionFlag=1
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.OffsetNumber-2\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.OffsetNumber-3\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.OffsetNumber-4\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.OffsetNumber-5\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.OffsetNumber-6\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.OffsetNumber-7\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.OffsetNumber-8\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.OffsetNumber-9\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.OffsetSign-0\#ChannelRegularConversion=ADC_OFFSET_SIGN_NEGATIVE
ADC1.OffsetSign-1\#ChannelRegularConversion=ADC_OFFSET_SIGN_NEGATIVE
ADC1.OffsetSign-2\#ChannelRegularConversion=ADC_OFFSET_SIGN_NEGATIVE
ADC1.OffsetSign-3\#ChannelRegularConversion=ADC_OFFSET_SIGN_NEGATIVE
ADC1.OffsetSign-4\#ChannelRegularConversion=ADC_OFFSET_SIGN_NEGATIVE
ADC1.OffsetSign-5\#ChannelRegularConversion=ADC_OFFSET_SIGN_NEGATIVE
ADC1.OffsetSign-6\#ChannelRegularConversion=ADC_OFFSET_SIGN_NEGATIVE
ADC1.OffsetSign-7\#ChannelRegularConversion=ADC_OFFSET_SIGN_NEGATIVE
ADC1.OffsetSign-8\#ChannelRegularConversion=ADC_OFFSET_SIGN_NEGATIVE
ADC1.OffsetSign-9\#ChannelRegularConversion=ADC_OFFSET_SIGN_NEGATIVE
ADC1.Rank-0\#ChannelRegularConversion=1
ADC1.Rank-1\#ChannelRegularConversion=2
ADC1.Rank-2\#ChannelRegularConversion=3
ADC1.Rank-3\#ChannelRegularConversion=4
ADC1.Rank-4\#ChannelRegularConversion=5
ADC1.Rank-5\#ChannelRegularConversion=6
ADC1.Rank-6\#ChannelRegularConversion=7
ADC1.Rank-7\#ChannelRegularConversion=8
ADC1.Rank-8\#ChannelRegularConversion=9
ADC1.Rank-9\#ChannelRegularConversion=10
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_6CYCLES_5
ADC1.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_6CYCLES_5
ADC1.SamplingTime-2\#ChannelRegularConversion=ADC_SAMPLETIME_6CYCLES_5
ADC1.SamplingTime-3\#ChannelRegularConversion=ADC_SAMPLETIME_6CYCLES_5
ADC1.SamplingTime-4\#ChannelRegularConversion=ADC_SAMPLETIME_6CYCLES_5
ADC1.SamplingTime-5\#ChannelRegularConversion=ADC_SAMPLETIME_6CYCLES_5
ADC1.SamplingTime-6\#ChannelRegularConversion=ADC_SAMPLETIME_6CYCLES_5
ADC1.SamplingTime-7\#ChannelRegularConversion=ADC_SAMPLETIME_6CYCLES_5
ADC1.SamplingTime-8\#ChannelRegularConversion=ADC_SAMPLETIME_6CYCLES_5
ADC1.SamplingTime-9\#ChannelRegularConversion=ADC_SAMPLETIME_6CYCLES_5
ADC1.master=1
Appli.IPs=CORTEX_M7_APPLI\:I,GPDMA1\:I,HPDMA1\:I,LINKEDLIST\:I,RCC\:I,GPIO,NVIC2\:I,USB_OTG_HS,UCPD1,USBPD,I2C3,USART3,ETH,RTC,TAMP,ADF1,CORDIC,CRC,DEBUG,SPI3,I2C1,SPI1,ADC1,I2C2,FDCAN1,USART1,PWR,SBS,TIM15
Boot.IPs=CORTEX_M7_BOOT\:I,GPDMA1,HPDMA1,LINKEDLIST,RCC,GPIO,NVIC1\:I,FLASH,MEMORYMAP\:I,EXTMEM_MANAGER,SYS\:I,USB_OTG_HS,XSPI2,UCPD1,USBPD,I2C3,USART3,ETH,RTC,TAMP,ADF1,CORDIC,CRC,HASH\:I,RNG\:I,DEBUG,SPI3,I2C1,SPI1,SDMMC1,ADC1,I2C2,FDCAN1,XSPI1,USART1,PWR,SBS,TIM15
Boot.Pins=PB7,PC13,PD13,PD10
CAD.formats=[]
CAD.pinconfig=Dual
CAD.provider=
CORTEX_M7_APPLI.IPParameters=default_mode_Activation
CORTEX_M7_APPLI.default_mode_Activation=1
CORTEX_M7_BOOT.AccessPermission_S-Cortex_Memory_Protection_Unit_Region1_Settings_S=MPU_REGION_FULL_ACCESS
CORTEX_M7_BOOT.BaseAddress_S-Cortex_Memory_Protection_Unit_Region1_Settings_S=0x08fff000
CORTEX_M7_BOOT.CPU_DCache=Enabled
CORTEX_M7_BOOT.CPU_ICache=Enabled
CORTEX_M7_BOOT.DisableExec_S-Cortex_Memory_Protection_Unit_Region1_Settings_S=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7_BOOT.Enable_S-Cortex_Memory_Protection_Unit_Region1_Settings_S=MPU_REGION_ENABLE
CORTEX_M7_BOOT.IPParameters=default_mode_Activation,CPU_ICache,CPU_DCache,Enable_S-Cortex_Memory_Protection_Unit_Region1_Settings_S,BaseAddress_S-Cortex_Memory_Protection_Unit_Region1_Settings_S,Size_S-Cortex_Memory_Protection_Unit_Region1_Settings_S,AccessPermission_S-Cortex_Memory_Protection_Unit_Region1_Settings_S,DisableExec_S-Cortex_Memory_Protection_Unit_Region1_Settings_S
CORTEX_M7_BOOT.Size_S-Cortex_Memory_Protection_Unit_Region1_Settings_S=MPU_REGION_SIZE_256B
CORTEX_M7_BOOT.default_mode_Activation=1
ETH.IPParameters=MediaInterface
ETH.MediaInterface=HAL_ETH_RMII_MODE
ExtMemLoader.IPs=EXTMEM_LOADER\:I,EXTMEM_MANAGER\:I,GPIO
FDCAN1.CalculateBaudRateNominal=500000
FDCAN1.CalculateTimeBitNominal=2000
FDCAN1.CalculateTimeQuantumNominal=666.6666666666666
FDCAN1.IPParameters=CalculateTimeQuantumNominal,CalculateTimeBitNominal,CalculateBaudRateNominal
FLASH.IPParameters=OB_ECC_ON_SRAM_UI,OB_User_Configuration1_active,OB_ITCM_active,OB_DTCM_active,OB_DTCM_AXI_SHARE,OB_ITCM_AXI_SHARE
FLASH.OB_DTCM_AXI_SHARE=OB_DTCM_AXI_SHARE_1
FLASH.OB_DTCM_active=true
FLASH.OB_ECC_ON_SRAM_UI=OB_AXISRAM_ECC_DISABLE
FLASH.OB_ITCM_AXI_SHARE=OB_ITCM_AXI_SHARE_0
FLASH.OB_ITCM_active=true
FLASH.OB_User_Configuration1_active=false
File.Version=6
GPIO.groupedBy=Group By Peripherals
HASH.Algorithm=HASH_ALGOSELECTION_SHA512
HASH.HASHMAC=No
HASH.IPParameters=Algorithm,HASHMAC
I2C1.IPParameters=Timing
I2C1.Timing=0x20C0EDFF
I2C2.IPParameters=Timing,Timeout
I2C2.Timeout=0x00008727
I2C2.Timing=0x20C0EDFF
I2C3.IPParameters=Timing
I2C3.Timing=0x20C0EDFF
KeepUserPlacement=false
MMTAppReg1.MEMORYMAP.AppRegionName=DTCM
MMTAppReg1.MEMORYMAP.ContextName=Boot
MMTAppReg1.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg1.MEMORYMAP.DefaultDataRegion=true
MMTAppReg1.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,Shareability
MMTAppReg1.MEMORYMAP.Name=DTCM
MMTAppReg1.MEMORYMAP.Shareability=Shareable
MMTAppReg1.MEMORYMAP.Size=131072
MMTAppReg1.MEMORYMAP.StartAddress=0x20000000
MMTAppReg2.MEMORYMAP.AppRegionName=RAM
MMTAppReg2.MEMORYMAP.ContextName=Boot
MMTAppReg2.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg2.MEMORYMAP.DefaultDataRegion=true
MMTAppReg2.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,ContextName,Name,DefaultDataRegion,Shareability
MMTAppReg2.MEMORYMAP.Name=RAM
MMTAppReg2.MEMORYMAP.Shareability=Shareable
MMTAppReg2.MEMORYMAP.Size=327680
MMTAppReg2.MEMORYMAP.StartAddress=0x24000000
MMTAppReg3.MEMORYMAP.AppRegionName=ITCM
MMTAppReg3.MEMORYMAP.Cacheability=WTRA
MMTAppReg3.MEMORYMAP.ContextName=Boot
MMTAppReg3.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg3.MEMORYMAP.DefaultDataRegion=false
MMTAppReg3.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,Cacheability
MMTAppReg3.MEMORYMAP.Name=ITCM
MMTAppReg3.MEMORYMAP.Size=65536
MMTAppReg3.MEMORYMAP.StartAddress=0x00000000
MMTAppReg4.MEMORYMAP.AP=RO_priv_only
MMTAppReg4.MEMORYMAP.AppRegionName=FLASH
MMTAppReg4.MEMORYMAP.Cacheability=WTRA
MMTAppReg4.MEMORYMAP.ContextName=Boot
MMTAppReg4.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg4.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg4.MEMORYMAP.DefaultDataRegion=false
MMTAppReg4.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,MemType,ContextName,Name,AP,Cacheability,DefaultCodeRegion
MMTAppReg4.MEMORYMAP.MemType=ROM
MMTAppReg4.MEMORYMAP.Name=FLASH
MMTAppReg4.MEMORYMAP.Size=65536
MMTAppReg4.MEMORYMAP.StartAddress=0x08000000
MMTAppReg5.MEMORYMAP.AppRegionName=DTCM
MMTAppReg5.MEMORYMAP.ContextName=Appli
MMTAppReg5.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg5.MEMORYMAP.DefaultDataRegion=true
MMTAppReg5.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,Shareability
MMTAppReg5.MEMORYMAP.Name=DTCM
MMTAppReg5.MEMORYMAP.Shareability=Shareable
MMTAppReg5.MEMORYMAP.Size=131072
MMTAppReg5.MEMORYMAP.StartAddress=0x20000000
MMTAppReg6.MEMORYMAP.AppRegionName=RAM
MMTAppReg6.MEMORYMAP.ContextName=Appli
MMTAppReg6.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg6.MEMORYMAP.DefaultDataRegion=true
MMTAppReg6.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,ContextName,Name,DefaultDataRegion,Shareability
MMTAppReg6.MEMORYMAP.Name=RAM
MMTAppReg6.MEMORYMAP.Shareability=Shareable
MMTAppReg6.MEMORYMAP.Size=327680
MMTAppReg6.MEMORYMAP.StartAddress=0x24000000
MMTAppReg7.MEMORYMAP.AppRegionName=ITCM
MMTAppReg7.MEMORYMAP.Cacheability=WTRA
MMTAppReg7.MEMORYMAP.ContextName=Appli
MMTAppReg7.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg7.MEMORYMAP.DefaultDataRegion=false
MMTAppReg7.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,Cacheability
MMTAppReg7.MEMORYMAP.Name=ITCM
MMTAppReg7.MEMORYMAP.Size=65536
MMTAppReg7.MEMORYMAP.StartAddress=0x00000000
MMTAppReg8.MEMORYMAP.AP=RO_priv_only
MMTAppReg8.MEMORYMAP.AppRegionName=FLASH
MMTAppReg8.MEMORYMAP.Cacheability=WTRA
MMTAppReg8.MEMORYMAP.ContextName=Appli
MMTAppReg8.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg8.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg8.MEMORYMAP.DefaultDataRegion=false
MMTAppReg8.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,MemType,ContextName,Name,AP,Cacheability,DefaultCodeRegion
MMTAppReg8.MEMORYMAP.InvalidRegion=true
MMTAppReg8.MEMORYMAP.MemType=ROM
MMTAppReg8.MEMORYMAP.Name=FLASH
MMTAppReg8.MEMORYMAP.Size=73728
MMTAppReg8.MEMORYMAP.StartAddress=0x70000000
MMTAppRegionsCount=8
MMTConfigApplied=false
Mcu.CPN=STM32H7S3L8H6
Mcu.Context0=Boot
Mcu.Context1=Appli
Mcu.Context2=ExtMemLoader
Mcu.ContextNb=3
Mcu.Family=STM32H7
Mcu.IP0=ADC1
Mcu.IP1=CORTEX_M7_APPLI
Mcu.IP10=I2C3
Mcu.IP11=MEMORYMAP
Mcu.IP12=NVIC2
Mcu.IP13=NVIC1
Mcu.IP14=PWR
Mcu.IP15=RCC
Mcu.IP16=RNG
Mcu.IP17=RTC
Mcu.IP18=SBS
Mcu.IP19=SDMMC1
Mcu.IP2=CORTEX_M7_BOOT
Mcu.IP20=SPI1
Mcu.IP21=SPI3
Mcu.IP22=SYS
Mcu.IP23=TIM15
Mcu.IP24=UCPD1
Mcu.IP25=USART1
Mcu.IP26=USART3
Mcu.IP27=USB_OTG_HS
Mcu.IP28=XSPI1
Mcu.IP29=XSPI2
Mcu.IP3=DEBUG
Mcu.IP4=ETH
Mcu.IP5=FDCAN1
Mcu.IP6=FLASH
Mcu.IP7=HASH
Mcu.IP8=I2C1
Mcu.IP9=I2C2
Mcu.IPNb=30
Mcu.Name=STM32H7S3L8Hx
Mcu.Package=TFBGA225 OCTO SMPS
Mcu.Pin0=PF2
Mcu.Pin1=PM6
Mcu.Pin10=PC11
Mcu.Pin11=PB9
Mcu.Pin12=PB3(JTDO/TRACESWO)
Mcu.Pin13=PF1
Mcu.Pin14=PM8
Mcu.Pin15=PM1
Mcu.Pin16=PD0
Mcu.Pin17=PC15-OSC32_OUT(OSC32_OUT)
Mcu.Pin18=PC14-OSC32_IN(OSC32_IN)
Mcu.Pin19=PB7
Mcu.Pin2=PD2
Mcu.Pin20=PB4(NJTRST)
Mcu.Pin21=PM0
Mcu.Pin22=PC12
Mcu.Pin23=PA14(JTCK/SWCLK)
Mcu.Pin24=PA9
Mcu.Pin25=PC8
Mcu.Pin26=PC13
Mcu.Pin27=PB6
Mcu.Pin28=PD6
Mcu.Pin29=PA13(JTMS/SWDIO)
Mcu.Pin3=PB8
Mcu.Pin30=PA10
Mcu.Pin31=PC9
Mcu.Pin32=PG12
Mcu.Pin33=PG11
Mcu.Pin34=PE5
Mcu.Pin35=PA8
Mcu.Pin36=PN1
Mcu.Pin37=PG13
Mcu.Pin38=PN3
Mcu.Pin39=PN0
Mcu.Pin4=PB5
Mcu.Pin40=PN11
Mcu.Pin41=PN10
Mcu.Pin42=PN9
Mcu.Pin43=PN2
Mcu.Pin44=PN6
Mcu.Pin45=PH0-OSC_IN(PH0)
Mcu.Pin46=PH1-OSC_OUT(PH1)
Mcu.Pin47=PC0
Mcu.Pin48=PN8
Mcu.Pin49=PN4
Mcu.Pin5=PF0
Mcu.Pin50=PN5
Mcu.Pin51=PC2
Mcu.Pin52=PC3
Mcu.Pin53=PA2
Mcu.Pin54=PC4
Mcu.Pin55=PD14
Mcu.Pin56=PA4
Mcu.Pin57=PA7
Mcu.Pin58=PF11
Mcu.Pin59=PG6
Mcu.Pin6=PM9
Mcu.Pin60=PD8
Mcu.Pin61=PB14
Mcu.Pin62=PA3
Mcu.Pin63=PA5
Mcu.Pin64=PC5
Mcu.Pin65=PB2
Mcu.Pin66=PG4
Mcu.Pin67=PP2
Mcu.Pin68=PP3
Mcu.Pin69=PP0
Mcu.Pin7=PM5
Mcu.Pin70=PO0
Mcu.Pin71=PA6
Mcu.Pin72=PG5
Mcu.Pin73=PP1
Mcu.Pin74=PD9
Mcu.Pin75=PD13
Mcu.Pin76=PB1
Mcu.Pin77=PF12
Mcu.Pin78=PO4
Mcu.Pin79=PD10
Mcu.Pin8=PD1
Mcu.Pin80=VP_ADC1_TempSens_Input
Mcu.Pin81=VP_ADC1_Vref_Input
Mcu.Pin82=VP_FLASH_SIG_Activate_FlashIP
Mcu.Pin83=VP_HASH_VS_HASH
Mcu.Pin84=VP_PWR_VS_USBReg
Mcu.Pin85=VP_RCC_VS_RMII
Mcu.Pin86=VP_RNG_VS_RNG
Mcu.Pin87=VP_RTC_VS_RTC_Activate
Mcu.Pin88=VP_RTC_VS_RTC_Calendar
Mcu.Pin89=VP_SBS_VS-SBS
Mcu.Pin9=PC10
Mcu.Pin90=VP_SYS_VS_Systick
Mcu.Pin91=VP_TIM15_VS_ClockSourceINT
Mcu.Pin92=VP_XSPI1_VS_quad
Mcu.Pin93=VP_XSPI2_VS_octo
Mcu.Pin94=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.PinsNb=95
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32H7S3L8Hx
MxCube.Version=6.12.1
MxDb.Version=DB.6.0.121
NVIC1.ADC1_2_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC1.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.EXTI13_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC1.ForceEnableDMAVector=true
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.OTG_HS_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC1.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC1.RNG_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC1.TIM15_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC1.USART1_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC1.USART3_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC1.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.ADC1_2_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC2.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.ForceEnableDMAVector=true
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.OTG_HS_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC2.TIM15_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC2.USART1_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC2.USART3_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA10.GPIOParameters=GPIO_Label,PinAttribute
PA10.GPIO_Label=UART_SHLD_A_RX
PA10.Mode=Asynchronous
PA10.PinAttribute=Boot,Appli
PA10.Signal=USART1_RX
PA13(JTMS/SWDIO).Mode=Serial_Wire
PA13(JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PA14(JTCK/SWCLK).Mode=Serial_Wire
PA14(JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PA2.GPIOParameters=PinAttribute
PA2.Mode=RMII
PA2.PinAttribute=Boot,Appli
PA2.Signal=ETH_MDIO
PA3.GPIOParameters=GPIO_Label,PinAttribute
PA3.GPIO_Label=AIN_SHLD_A0
PA3.PinAttribute=Boot,Appli
PA3.Signal=ADCx_INP15
PA4.GPIOParameters=GPIO_Label,PinAttribute
PA4.GPIO_Label=SPI_SHLD_B_NSS
PA4.Mode=NSS_Signal_Hard_Output
PA4.PinAttribute=Boot,Appli
PA4.Signal=SPI3_NSS
PA5.GPIOParameters=GPIO_Label,PinAttribute
PA5.GPIO_Label=SPI_SHLD_A_SCK
PA5.Mode=Full_Duplex_Master
PA5.PinAttribute=Boot,Appli
PA5.Signal=SPI1_SCK
PA6.GPIOParameters=GPIO_Label,PinAttribute
PA6.GPIO_Label=SPI_SHLD_A_MISO
PA6.Mode=Full_Duplex_Master
PA6.PinAttribute=Boot,Appli
PA6.Signal=SPI1_MISO
PA7.GPIOParameters=PinAttribute
PA7.Mode=RMII
PA7.PinAttribute=Boot,Appli
PA7.Signal=ETH_RMII_CRS_DV
PA8.GPIOParameters=GPIO_Label,PinAttribute
PA8.GPIO_Label=I2C_SYS_SCL
PA8.Mode=I2C
PA8.PinAttribute=Boot,Appli
PA8.Signal=I2C3_SCL
PA9.GPIOParameters=GPIO_Label,PinAttribute
PA9.GPIO_Label=I2C_SYS_SDA
PA9.Mode=I2C
PA9.PinAttribute=Boot,Appli
PA9.Signal=I2C3_SDA
PB1.GPIOParameters=GPIO_Label,PinAttribute
PB1.GPIO_Label=AIN_SHLD_A6
PB1.PinAttribute=Boot,Appli
PB1.Signal=ADCx_INP5
PB14.GPIOParameters=GPIO_Label,PinAttribute
PB14.GPIO_Label=UART_SHLD_A_TX
PB14.Mode=Asynchronous
PB14.PinAttribute=Boot,Appli
PB14.Signal=USART1_TX
