ebs-universe/ebs-sandbox-stm32h7rsxx/resources/h7s3l8_nucleo_mx.ioc
PB2.GPIOParameters=GPIO_Label,PinAttribute
PB2.GPIO_Label=SPI_SHLD_B_MOSI
PB2.Locked=true
PB2.Mode=Full_Duplex_Master
PB2.PinAttribute=Boot,Appli
PB2.Signal=SPI3_MOSI
PB3(JTDO/TRACESWO).GPIOParameters=GPIO_Label,PinAttribute
PB3(JTDO/TRACESWO).GPIO_Label=SPI_SHLD_B_SCK
PB3(JTDO/TRACESWO).Locked=true
PB3(JTDO/TRACESWO).Mode=Full_Duplex_Master
PB3(JTDO/TRACESWO).PinAttribute=Boot,Appli
PB3(JTDO/TRACESWO).Signal=SPI3_SCK
PB4(NJTRST).GPIOParameters=GPIO_Label,PinAttribute
PB4(NJTRST).GPIO_Label=SPI_SHLD_B_MISO
PB4(NJTRST).Locked=true
PB4(NJTRST).Mode=Full_Duplex_Master
PB4(NJTRST).PinAttribute=Boot,Appli
PB4(NJTRST).Signal=SPI3_MISO
PB5.GPIOParameters=GPIO_Label,PinAttribute
PB5.GPIO_Label=SPI_SHLD_A_MOSI
PB5.Mode=Full_Duplex_Master
PB5.PinAttribute=Boot,Appli
PB5.Signal=SPI1_MOSI
PB6.GPIOParameters=PinAttribute
PB6.Locked=true
PB6.Mode=RMII
PB6.PinAttribute=Boot,Appli
PB6.Signal=ETH_RMII_REF_CLK
PB7.ContextOwner=Boot
PB7.GPIOParameters=GPIO_Label,PinAttribute
PB7.GPIO_Label=LED_RED
PB7.Locked=true
PB7.PinAttribute=Boot,Appli,ExtMemLoader
PB7.Signal=GPIO_Output
PB8.GPIOParameters=GPIO_Label,PinAttribute
PB8.GPIO_Label=I2C_SHLD_A_SCL
PB8.Mode=I2C
PB8.PinAttribute=Boot,Appli
PB8.Signal=I2C1_SCL
PB9.GPIOParameters=GPIO_Label,PinAttribute
PB9.GPIO_Label=I2C_SHLD_A_SDA
PB9.Mode=I2C
PB9.PinAttribute=Boot,Appli
PB9.Signal=I2C1_SDA
PC0.GPIOParameters=GPIO_Label,PinAttribute
PC0.GPIO_Label=AIN_SHLD_A1
PC0.PinAttribute=Boot,Appli
PC0.Signal=ADCx_INP10
PC10.GPIOParameters=GPIO_Label,PinAttribute
PC10.GPIO_Label=SDMMC_SHLD_D2
PC10.Mode=SD_4_bits_Wide_bus
PC10.PinAttribute=Boot
PC10.Signal=SDMMC1_D2
PC11.GPIOParameters=GPIO_Label,PinAttribute
PC11.GPIO_Label=SDMMC_SHLD_D3
PC11.Mode=SD_4_bits_Wide_bus
PC11.PinAttribute=Boot
PC11.Signal=SDMMC1_D3
PC12.GPIOParameters=GPIO_Label,PinAttribute
PC12.GPIO_Label=SDMMC_SHLD_CK
PC12.Mode=SD_4_bits_Wide_bus
PC12.PinAttribute=Boot
PC12.Signal=SDMMC1_CK
PC13.ContextOwner=Boot
PC13.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI,PinAttribute
PC13.GPIO_Label=BUTTON_K1
PC13.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
PC13.Locked=true
PC13.PinAttribute=Boot,Appli,ExtMemLoader
PC13.Signal=GPXTI13
PC14-OSC32_IN(OSC32_IN).Mode=LSE-External-Oscillator
PC14-OSC32_IN(OSC32_IN).Signal=RCC_OSC32_IN
PC15-OSC32_OUT(OSC32_OUT).Mode=LSE-External-Oscillator
PC15-OSC32_OUT(OSC32_OUT).Signal=RCC_OSC32_OUT
PC2.GPIOParameters=GPIO_Label,PinAttribute
PC2.GPIO_Label=AIN_SHLD_A7
PC2.PinAttribute=Boot,Appli
PC2.Signal=ADCx_INP12
PC3.GPIOParameters=GPIO_Label,PinAttribute
PC3.GPIO_Label=AIN_SHLD_A2
PC3.PinAttribute=Boot,Appli
PC3.Signal=ADCx_INP13
PC4.GPIOParameters=GPIO_Label,PinAttribute
PC4.GPIO_Label=AIN_SHLD_A3
PC4.PinAttribute=Boot,Appli
PC4.Signal=ADCx_INP4
PC5.GPIOParameters=GPIO_Label,PinAttribute
PC5.GPIO_Label=AIN_SHLD_A4
PC5.PinAttribute=Boot,Appli
PC5.Signal=ADCx_INP8
PC8.GPIOParameters=GPIO_Label,PinAttribute
PC8.GPIO_Label=SDMMC_SHLD_D0
PC8.Mode=SD_4_bits_Wide_bus
PC8.PinAttribute=Boot
PC8.Signal=SDMMC1_D0
PC9.GPIOParameters=GPIO_Label,PinAttribute
PC9.GPIO_Label=SDMMC_SHLD_D1
PC9.Mode=SD_4_bits_Wide_bus
PC9.PinAttribute=Boot
PC9.Signal=SDMMC1_D1
PD0.GPIOParameters=GPIO_Label,PinAttribute
PD0.GPIO_Label=CAN_SHLD_RX
PD0.Mode=FDCAN_Activate
PD0.PinAttribute=Boot,Appli
PD0.Signal=FDCAN1_RX
PD1.GPIOParameters=GPIO_Label,PinAttribute
PD1.GPIO_Label=CAN_SHLD_TX
PD1.Mode=FDCAN_Activate
PD1.PinAttribute=Boot,Appli
PD1.Signal=FDCAN1_TX
PD10.ContextOwner=Boot
PD10.GPIOParameters=GPIO_Label,PinAttribute
PD10.GPIO_Label=LED_GREEN
PD10.Locked=true
PD10.PinAttribute=Boot,Appli,ExtMemLoader
PD10.Signal=GPIO_Output
PD13.ContextOwner=Boot
PD13.GPIOParameters=GPIO_Label,PinAttribute
PD13.GPIO_Label=LED_YELLOW
PD13.Locked=true
PD13.PinAttribute=Boot,Appli,ExtMemLoader
PD13.Signal=GPIO_Output
PD14.GPIOParameters=GPIO_Label,PinAttribute
PD14.GPIO_Label=SPI_SHLD_A_CS
PD14.Locked=true
PD14.PinAttribute=Free
PD14.Signal=GPIO_Output
PD2.GPIOParameters=GPIO_Label,PinAttribute
PD2.GPIO_Label=SDMMC_SHLD_CMD
PD2.Mode=SD_4_bits_Wide_bus
PD2.PinAttribute=Boot
PD2.Signal=SDMMC1_CMD
PD6.GPIOParameters=PinAttribute
PD6.Mode=Digital_ClockEthClk
PD6.PinAttribute=Free
PD6.Signal=ETH_CLK
PD8.GPIOParameters=GPIO_Label,PinAttribute
PD8.GPIO_Label=BCTX
PD8.Locked=true
PD8.Mode=Asynchronous
PD8.PinAttribute=Boot,Appli
PD8.Signal=USART3_TX
PD9.GPIOParameters=GPIO_Label,PinAttribute
PD9.GPIO_Label=BCRX
PD9.Locked=true
PD9.Mode=Asynchronous
PD9.PinAttribute=Boot,Appli
PD9.Signal=USART3_RX
PE5.GPIOParameters=PinAttribute
PE5.PinAttribute=Boot,Appli
PE5.Signal=S_TIM15_CH1
PF0.GPIOParameters=GPIO_Label,PinAttribute
PF0.GPIO_Label=I2C_SHLD_B_SDA
PF0.Mode=SMBus-Alert-mode
PF0.PinAttribute=Boot,Appli
PF0.Signal=I2C2_SDA
PF1.GPIOParameters=GPIO_Label,PinAttribute
PF1.GPIO_Label=I2C_SHLD_B_SCL
PF1.Mode=SMBus-Alert-mode
PF1.PinAttribute=Boot,Appli
PF1.Signal=I2C2_SCL
PF11.GPIOParameters=GPIO_Label,PinAttribute
PF11.GPIO_Label=AIN_SHLD_A5
PF11.Mode=IN2-Single-Ended
PF11.PinAttribute=Boot,Appli
PF11.Signal=ADC1_INP2
PF12.GPIOParameters=GPIO_Label,PinAttribute
PF12.GPIO_Label=AIN_SHLD_A8
PF12.Mode=IN6-Single-Ended
PF12.PinAttribute=Boot,Appli
PF12.Signal=ADC1_INP6
PF2.GPIOParameters=GPIO_Label,PinAttribute
PF2.GPIO_Label=I2C_SHLD_B_SMBA
PF2.Mode=SMBus-Alert-mode
PF2.PinAttribute=Boot,Appli
PF2.Signal=I2C2_SMBA
PG11.GPIOParameters=PinAttribute
PG11.Mode=RMII
PG11.PinAttribute=Boot,Appli
PG11.Signal=ETH_RMII_TX_EN
PG12.GPIOParameters=PinAttribute
PG12.Locked=true
PG12.Mode=RMII
PG12.PinAttribute=Boot,Appli
PG12.Signal=ETH_RMII_TXD1
PG13.GPIOParameters=PinAttribute
PG13.Mode=RMII
PG13.PinAttribute=Boot,Appli
PG13.Signal=ETH_RMII_TXD0
PG4.GPIOParameters=PinAttribute
PG4.Locked=true
PG4.Mode=RMII
PG4.PinAttribute=Boot,Appli
PG4.Signal=ETH_RMII_RXD0
PG5.GPIOParameters=PinAttribute
PG5.Locked=true
PG5.Mode=RMII
PG5.PinAttribute=Boot,Appli
PG5.Signal=ETH_RMII_RXD1
PG6.GPIOParameters=PinAttribute
PG6.Locked=true
PG6.Mode=RMII
PG6.PinAttribute=Boot,Appli
PG6.Signal=ETH_MDC
PH0-OSC_IN(PH0).Mode=HSE-External-Oscillator
PH0-OSC_IN(PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT(PH1).Mode=HSE-External-Oscillator
PH1-OSC_OUT(PH1).Signal=RCC_OSC_OUT
PM0.GPIOParameters=PinAttribute
PM0.Mode=Sink_AllSignals
PM0.PinAttribute=Boot,Appli
PM0.Signal=UCPD1_CC1
PM1.GPIOParameters=PinAttribute
PM1.Mode=Sink_AllSignals
PM1.PinAttribute=Boot,Appli
PM1.Signal=UCPD1_CC2
PM5.Mode=Internal_Phy_Device
PM5.Signal=USB_OTG_HS_DM
PM6.Mode=Internal_Phy_Device
PM6.Signal=USB_OTG_HS_DP
PM8.GPIOParameters=GPIO_Label,PinAttribute
PM8.GPIO_Label=USB_INT
PM8.Locked=true
PM8.PinAttribute=Free
PM8.Signal=GPXTI8
PM9.GPIOParameters=GPIO_Label,PinAttribute
PM9.GPIO_Label=USB_PWREN
PM9.Locked=true
PM9.PinAttribute=Free
PM9.Signal=GPIO_Output
PN0.GPIOParameters=PinAttribute
PN0.Mode=XSPI2_Port2Octo
PN0.PinAttribute=Boot
PN0.Signal=XSPIM_P2_DQS0
PN1.GPIOParameters=PinAttribute
PN1.Mode=XSPI2_NCS1_Port2
PN1.PinAttribute=Boot
PN1.Signal=XSPIM_P2_NCS1
PN10.GPIOParameters=PinAttribute
PN10.Mode=XSPI2_Port2Octo
PN10.PinAttribute=Boot
PN10.Signal=XSPIM_P2_IO6
PN11.GPIOParameters=PinAttribute
PN11.Mode=XSPI2_Port2Octo
PN11.PinAttribute=Boot
PN11.Signal=XSPIM_P2_IO7
PN2.GPIOParameters=PinAttribute
PN2.Mode=XSPI2_Port2Octo
PN2.PinAttribute=Boot
PN2.Signal=XSPIM_P2_IO0
PN3.GPIOParameters=PinAttribute
PN3.Mode=XSPI2_Port2Octo
PN3.PinAttribute=Boot
PN3.Signal=XSPIM_P2_IO1
PN4.GPIOParameters=PinAttribute
PN4.Mode=XSPI2_Port2Octo
PN4.PinAttribute=Boot
PN4.Signal=XSPIM_P2_IO2
PN5.GPIOParameters=PinAttribute
PN5.Mode=XSPI2_Port2Octo
PN5.PinAttribute=Boot
PN5.Signal=XSPIM_P2_IO3
PN6.GPIOParameters=PinAttribute
PN6.Mode=XSPI2_Port2Octo
PN6.PinAttribute=Boot
PN6.Signal=XSPIM_P2_CLK
PN8.GPIOParameters=PinAttribute
PN8.Mode=XSPI2_Port2Octo
PN8.PinAttribute=Boot
PN8.Signal=XSPIM_P2_IO4
PN9.GPIOParameters=PinAttribute
PN9.Mode=XSPI2_Port2Octo
PN9.PinAttribute=Boot
PN9.Signal=XSPIM_P2_IO5
PO0.GPIOParameters=GPIO_Label,PinAttribute
PO0.GPIO_Label=OSPI_SHLD_CS
PO0.Locked=true
PO0.Mode=XSPI1_NCS1_Port1
PO0.PinAttribute=Boot
PO0.Signal=XSPIM_P1_NCS1
PO4.GPIOParameters=GPIO_Label,PinAttribute
PO4.GPIO_Label=OSPI_SHLD_CLK
PO4.Mode=XSPI1_Port1Quad
PO4.PinAttribute=Boot
PO4.Signal=XSPIM_P1_CLK
PP0.GPIOParameters=GPIO_Label,PinAttribute
PP0.GPIO_Label=OSPI_SHLD_IO0
PP0.Mode=XSPI1_Port1Quad
PP0.PinAttribute=Boot
PP0.Signal=XSPIM_P1_IO0
PP1.GPIOParameters=GPIO_Label,PinAttribute
PP1.GPIO_Label=OSPI_SHLD_IO1
PP1.Mode=XSPI1_Port1Quad
PP1.PinAttribute=Boot
PP1.Signal=XSPIM_P1_IO1
PP2.GPIOParameters=GPIO_Label,PinAttribute
PP2.GPIO_Label=OSPI_SHLD_IO2
PP2.Mode=XSPI1_Port1Quad
PP2.PinAttribute=Boot
PP2.Signal=XSPIM_P1_IO2
PP3.GPIOParameters=GPIO_Label,PinAttribute
PP3.GPIO_Label=OSPI_SHLD_IO3
PP3.Mode=XSPI1_Port1Quad
PP3.PinAttribute=Boot
PP3.Signal=XSPIM_P1_IO3
PWR.IPParameters=USB_HS_REGEN
PWR.USB_HS_REGEN=Enable
PinOutPanel.CurrentBGAView=Top
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=true
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32H7S3L8Hx
ProjectManager.FirmwarePackage=STM32Cube FW_H7RS V1.1.0
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=App-0x200,Boot-0x200,ExtMemLoader-0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=STM32CubeIDE
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=h7s3l8_nucleo_mx.ioc
ProjectManager.ProjectName=h7s3l8_nucleo_mx
ProjectManager.ProjectStructure=Boot\:Boot Project\:true;App\:Appli Project\:true;ExtMemLoader\:ExtMemLoader Project\:false;
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=App-0x400,Boot-0x400,ExtMemLoader-0x400
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=true
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false-Boot,2-MX_GPIO_Init-GPIO-false-HAL-true-Boot,3-MX_FLASH_Init-FLASH-false-HAL-true-Boot,4-MX_XSPI2_Init-XSPI2-false-HAL-true-Boot,5-MX_USB_OTG_HS_PCD_Init-USB_OTG_HS-false-HAL-true-Boot,6-MX_ADC1_Init-ADC1-false-HAL-true-Boot,7-MX_ETH_Init-ETH-false-HAL-true-Boot,8-MX_FDCAN1_Init-FDCAN1-false-HAL-true-Boot,9-MX_HASH_Init-HASH-false-HAL-true-Boot,10-MX_I2C1_Init-I2C1-false-HAL-true-Boot,11-MX_I2C2_SMBUS_Init-I2C2-false-HAL-true-Boot,12-MX_I2C3_Init-I2C3-false-HAL-true-Boot,13-MX_RNG_Init-RNG-false-HAL-true-Boot,14-MX_RTC_Init-RTC-false-HAL-true-Boot,15-MX_SDMMC1_SD_Init-SDMMC1-false-HAL-true-Boot,16-MX_SPI1_Init-SPI1-false-HAL-true-Boot,17-MX_SPI3_Init-SPI3-false-HAL-true-Boot,18-MX_UCPD1_Init-UCPD1-false-LL-true-Boot,19-MX_USART1_UART_Init-USART1-false-HAL-true-Boot,20-MX_USART3_UART_Init-USART3-false-HAL-true-Boot,21-MX_XSPI1_Init-XSPI1-false-HAL-true-Boot,22-MX_SBS_Init-SBS-false-HAL-true-Boot,23-MX_TIM15_Init-TIM15-false-HAL-true-Boot,1-SystemClock_Config-RCC-false-HAL-false-Appli,2-MX_GPIO_Init-GPIO-false-HAL-true-Appli,3-MX_USB_OTG_HS_PCD_Init-USB_OTG_HS-false-HAL-true-Appli,4-MX_ADC1_Init-ADC1-false-HAL-true-Appli,5-MX_ETH_Init-ETH-false-HAL-true-Appli,6-MX_FDCAN1_Init-FDCAN1-false-HAL-true-Appli,7-MX_I2C1_Init-I2C1-false-HAL-true-Appli,8-MX_I2C2_SMBUS_Init-I2C2-false-HAL-true-Appli,9-MX_I2C3_Init-I2C3-false-HAL-true-Appli,10-MX_RTC_Init-RTC-false-HAL-true-Appli,11-MX_SPI1_Init-SPI1-false-HAL-true-Appli,12-MX_SPI3_Init-SPI3-false-HAL-true-Appli,13-MX_UCPD1_Init-UCPD1-false-LL-true-Appli,14-MX_USART1_UART_Init-USART1-false-HAL-true-Appli,15-MX_USART3_UART_Init-USART3-false-HAL-true-Appli,16-MX_SBS_Init-SBS-false-HAL-true-Appli,17-MX_TIM15_Init-TIM15-false-HAL-true-Appli,0-MX_CORTEX_M7_BOOT_Init-CORTEX_M7_BOOT-false-HAL-true-Boot,0-MX_PWR_Init-PWR-false-HAL-true-Boot,0-MX_CORTEX_M7_APPLI_Init-CORTEX_M7_APPLI-false-HAL-true-Appli,0-MX_PWR_Init-PWR-false-HAL-true-Appli,1-SystemClock_Config-RCC-false-HAL-false-ExtMemLoader,2-MX_GPIO_Init-GPIO-false-HAL-true-ExtMemLoader
RCC.ADCFreq_Value=200000000
RCC.ADFFreq_Value=300000000
RCC.AHB1234Freq_Value=300000000
RCC.AHB5ClockFreq_Value=300000000
RCC.APB1Freq_Value=150000000
RCC.APB2Freq_Value=150000000
RCC.APB4Freq_Value=150000000
RCC.APB5Freq_Value=150000000
RCC.AXIClockFreq_Value=300000000
RCC.BMPRE=RCC_HCLK_DIV2
RCC.CECFreq_Value=32768
RCC.CKPERFreq_Value=64000000
RCC.CPREFreq_Value=600000000
RCC.CortexFreq_Value=600000000
RCC.CpuClockFreq_Value=600000000
RCC.DIGITAL_CLOCK_VALUE=25000000
RCC.DIVM1=2
RCC.DIVM2=3
RCC.DIVM3=3
RCC.DIVN1=50
RCC.DIVN2=50
RCC.DIVN3=50
RCC.DIVP1=1
RCC.DIVP1Freq_Value=600000000
RCC.DIVP2Freq_Value=200000000
RCC.DIVP3Freq_Value=200000000
RCC.DIVQ1Freq_Value=300000000
RCC.DIVQ2=4
RCC.DIVQ2Freq_Value=100000000
RCC.DIVQ3=4
RCC.DIVQ3Freq_Value=100000000
RCC.DIVR1Freq_Value=300000000
RCC.DIVR2Freq_Value=200000000
RCC.DIVR3=4
RCC.DIVR3Freq_Value=100000000
RCC.DIVS1Freq_Value=300000000
RCC.DIVS2Freq_Value=200000000
RCC.DIVS3=8
RCC.DIVS3Freq_Value=50000000
RCC.DIVT1Freq_Value=300000000
RCC.DIVT2=1
RCC.DIVT2Freq_Value=400000000
RCC.DIVT3Freq_Value=200000000
RCC.DTSFreq_Value=32768
RCC.ETH1CLockSelection=RCC_ETH1REFCLKSOURCE_ETH
RCC.ETH1Freq_Value=25000000
RCC.ETHPHYCLockSelection=RCC_ETH1PHYCLKSOURCE_PLL3S
RCC.ETHPHYFreq_Value=50000000
RCC.FDCANFreq_Value=24000000
RCC.FMCFreq_Value=300000000
RCC.FamilyName=M
RCC.HCLKFreq_Value=300000000
RCC.I2C23Freq_Value=150000000
RCC.I2CI3C1Freq_Value=150000000
RCC.IPParameters=ADCFreq_Value,ADFFreq_Value,AHB1234Freq_Value,AHB5ClockFreq_Value,APB1Freq_Value,APB2Freq_Value,APB4Freq_Value,APB5Freq_Value,AXIClockFreq_Value,BMPRE,CECFreq_Value,CKPERFreq_Value,CPREFreq_Value,CortexFreq_Value,CpuClockFreq_Value,DIGITAL_CLOCK_VALUE,DIVM1,DIVM2,DIVM3,DIVN1,DIVN2,DIVN3,DIVP1,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1Freq_Value,DIVQ2,DIVQ2Freq_Value,DIVQ3,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3,DIVR3Freq_Value,DIVS1Freq_Value,DIVS2Freq_Value,DIVS3,DIVS3Freq_Value,DIVT1Freq_Value,DIVT2,DIVT2Freq_Value,DIVT3Freq_Value,DTSFreq_Value,ETH1CLockSelection,ETH1Freq_Value,ETHPHYCLockSelection,ETHPHYFreq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLKFreq_Value,I2C23Freq_Value,I2CI3C1Freq_Value,LPTIM1Freq_Value,LPTIM23Freq_Value,LPTIM45Freq_Value,LPUART1Freq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,OSPI1Freq_Value,OSPI2Freq_Value,PLL2FRACN,PLL3FRACN,PLLFRACN,PLLSource,PPRE1,PPRE2,PPRE4,PPRE5,PSSIFreq_Value,RCC_TIM_PRescaler_Selection,RTCClockSelection,RTCFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI1Freq_Value,SPI23Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,SupplySource,TPIUFreq_Value,Tim1OutputFreq_Value,Tim2OutputFreq_Value,UCPDFreq_Value,USART1CLockSelection,USART1Freq_Value,USART234578CLockSelection,USART234578Freq_Value,USBOFSFreq_Value,USBPHYFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,Xspi2ClockSelection
RCC.LPTIM1Freq_Value=150000000
RCC.LPTIM23Freq_Value=150000000
RCC.LPTIM45Freq_Value=150000000
RCC.LPUART1Freq_Value=150000000
RCC.MCO1PinFreq_Value=64000000
RCC.MCO2PinFreq_Value=600000000
RCC.OSPI1Freq_Value=300000000
RCC.OSPI2Freq_Value=200000000
RCC.PLL2FRACN=0
RCC.PLL3FRACN=0
RCC.PLLFRACN=0
RCC.PLLSource=RCC_PLLSOURCE_HSE
RCC.PPRE1=RCC_APB1_DIV2
RCC.PPRE2=RCC_APB2_DIV2
RCC.PPRE4=RCC_APB4_DIV2
RCC.PPRE5=RCC_APB5_DIV2
RCC.PSSIFreq_Value=100000000
RCC.RCC_TIM_PRescaler_Selection=RCC_TIMPRES_DISABLE
RCC.RTCClockSelection=RCC_RTCCLKSOURCE_LSE
RCC.RTCFreq_Value=32768
RCC.SAI1Freq_Value=300000000
RCC.SAI2Freq_Value=300000000
RCC.SDMMCFreq_Value=200000000
RCC.SPDIFRXFreq_Value=300000000
RCC.SPI1Freq_Value=300000000
RCC.SPI23Freq_Value=300000000
RCC.SPI45Freq_Value=150000000
RCC.SPI6Freq_Value=150000000
RCC.SYSCLKFreq_VALUE=600000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.SupplySource=PWR_LDO_SUPPLY
RCC.TPIUFreq_Value=200000000
RCC.Tim1OutputFreq_Value=300000000
RCC.Tim2OutputFreq_Value=300000000
RCC.UCPDFreq_Value=16000000
RCC.USART1CLockSelection=RCC_USART1CLKSOURCE_PLL3Q
RCC.USART1Freq_Value=100000000
RCC.USART234578CLockSelection=RCC_USART234578CLKSOURCE_PLL3Q
RCC.USART234578Freq_Value=100000000
RCC.USBOFSFreq_Value=48000000
RCC.USBPHYFreq_Value=24000000
RCC.VCO1OutputFreq_Value=600000000
RCC.VCO2OutputFreq_Value=400000000
RCC.VCO3OutputFreq_Value=400000000
RCC.VCOInput1Freq_Value=12000000
RCC.VCOInput2Freq_Value=8000000
RCC.VCOInput3Freq_Value=8000000
RCC.Xspi2ClockSelection=RCC_XSPI2CLKSOURCE_PLL2S
SBS.IO_OTHER=Disable
SBS.IPParameters=XSPIM2,IO_OTHER,XSPIM1
SBS.XSPIM1=Disable
SBS.XSPIM2=Disable
SH.ADCx_INP10.0=ADC1_INP10,IN10-Single-Ended
SH.ADCx_INP10.ConfNb=1
SH.ADCx_INP12.0=ADC1_INP12,IN12-Single-Ended
SH.ADCx_INP12.ConfNb=1
SH.ADCx_INP13.0=ADC1_INP13,IN13-Single-Ended
SH.ADCx_INP13.ConfNb=1
SH.ADCx_INP15.0=ADC1_INP15,IN15-Single-Ended
SH.ADCx_INP15.ConfNb=1
SH.ADCx_INP4.0=ADC1_INP4,IN4-Single-Ended
SH.ADCx_INP4.ConfNb=1
SH.ADCx_INP5.0=ADC1_INP5,IN5-Single-Ended
SH.ADCx_INP5.ConfNb=1
SH.ADCx_INP8.0=ADC1_INP8,IN8-Single-Ended
SH.ADCx_INP8.ConfNb=1
SH.GPXTI13.0=GPIO_EXTI13
SH.GPXTI13.ConfNb=1
SH.GPXTI8.0=GPIO_EXTI8
SH.GPXTI8.ConfNb=1
SH.S_TIM15_CH1.0=TIM15_CH1,Output Compare1 CH1
SH.S_TIM15_CH1.ConfNb=1
SPI1.CalculateBaudRate=150.0 MBits/s
SPI1.Direction=SPI_DIRECTION_2LINES
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
SPI1.Mode=SPI_MODE_MASTER
SPI1.VirtualType=VM_MASTER
SPI3.CalculateBaudRate=150.0 MBits/s
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI3.Mode=SPI_MODE_MASTER
SPI3.VirtualNSS=VM_NSSHARD
SPI3.VirtualType=VM_MASTER
TIM15.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
TIM15.Channel-Output\ Compare1\ CH1=TIM_CHANNEL_1
TIM15.IPParameters=Prescaler,PeriodNoDither,TIM_MasterSlaveMode,TIM_MasterOutputTrigger,AutoReloadPreload,PulseNoDither_1,Channel-Output Compare1 CH1,OCMode_1
